In [1]:
import pandas as pd
import numpy as np 
import seaborn as sns
import scipy as sc
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('F:cvam\loant.csv')

In [3]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
df['Dependents'].replace('3+',4,inplace=True)

In [5]:
df["Dependents"].replace(np.nan,0,inplace=True)
#df['Dependents'].replace(np.nan,0,inplace=True)

In [6]:
df['LoanAmount'].replace(np.nan,0,inplace=True)

In [7]:
df['Loan_Amount_Term'].replace(np.nan,360,inplace=True)

In [8]:
a=pd.read_csv("F:\cvam\mis.csv")
a.head()

   Unnamed: 0  Credit_History
0           0             1.0
1           1             0.0
2           2             1.0
3           3             1.0
4           4             1.0

In [10]:
df["Credit_History"]=a["Credit_History"]

In [11]:
df["Credit_History"].isnull().sum()

0

In [12]:
df["Credit_History"].value_counts()

1.0    422
0.0    192
Name: Credit_History, dtype: int64

In [13]:
a=df['LoanAmount'].mean()
df['LoanAmount'].replace(0,a,inplace=True)

In [14]:
df['Loan_Status'].replace('Y',1,inplace=True)
df['Loan_Status'].replace('N',0,inplace=True)

In [15]:

df["Education"].replace("Graduate",1,inplace=True)
df["Education"].replace(" Not Graduate",0,inplace=True)

In [16]:
df["Self_Employed"].replace("Yes",1,inplace=True)
df["Self_Employed"].replace("No",0,inplace=True)

In [17]:
df["Property_Area"].replace("Rural",0,inplace=True)
df["Property_Area"].replace("Semiurban",1,inplace=True)
df["Property_Area"].replace("Urban",2,inplace=True)

In [18]:
df['Education'].replace("Not Graduate",0,inplace=True)

In [19]:
df["Self_Employed"].replace(np.nan,0.0,inplace=True)

In [20]:
df["Gender"].replace(np.nan,"Male",inplace=True)

In [21]:
df['Gender'].replace('Male',1,inplace=True)
df['Gender'].replace('Female',0,inplace=True)

In [22]:
df["Married"].replace(np.nan,"Yes",inplace=True)

In [23]:
df['Married'].replace('Yes',1,inplace=True)
df['Married'].replace('No',0,inplace=True)

In [24]:
df.head(20)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,1,0,0,1,0.0,5849,0.0,141.166124,360.0,1.0,2,1
1,LP001003,1,1,1,1,0.0,4583,1508.0,128.000000,360.0,0.0,0,0
2,LP001005,1,1,0,1,1.0,3000,0.0,66.000000,360.0,1.0,2,1
3,LP001006,1,1,0,0,0.0,2583,2358.0,120.000000,360.0,1.0,2,1
4,LP001008,1,0,0,1,0.0,6000,0.0,141.000000,360.0,1.0,2,1
5,LP001011,1,1,2,1,1.0,5417,4196.0,267.000000,360.0,1.0,2,1
6,LP001013,1,1,0,0,0.0,2333,1516.0,95.000000,360.0,1.0,2,1
7,LP001014,1,1,4,1,0.0,3036,2504.0,158.000000,360.0,0.0,1,0
8,LP001018,1,1,2,1,0.0,4006,1526.0,168.000000,360.0,1.0,2,1
9,LP001020,1,1,1,1,0.0,12841,10968.0,349.000000,360.0,0.0,1,0
10,LP001024,1,1,2,1,0.0,3200,700.0,70.000000,360.0,1.0,2,1
11,LP001027,1,1,2,1,0.0,2500,1840.0,109.000000,360.0,1.0,2,1
12,LP001028,1,1,2,1,0.0,3073,8106.0,200.000000,360.0,1.0,2,1
13,LP001029,1,0,0,1,0.0,1853,2840.0,114.000000,360.0,0.0,0,0
14,LP001030,1,1,2,1,0.0,1299,1086.0,17.000000,120.0,1.0,2,1
15,LP001032,1,0,0,1,0.0,4950,0.0,125.000000,360.0,1.0,2,1
16,LP001034,1,0,1,0,0.0,3596,0.0,100.000000,240.0,1.0,2,1
17,LP001036,0,0,0,1,0.0,3510,0.0,76.000000,360.0,0.0,2,0
18,LP001038,1,1,0,0,0.0,4887,0.0,133.000000,360.0,0.0,0,0
19,LP001041,1,1,0,1,0.0,2600,3500.0,115.000000,360.0,1.0,2,1

In [25]:
df["Dependents"]=df['Dependents'].astype(int)

In [26]:
df.shape

(614, 13)

In [27]:
li=[]
for i in df.columns:
    if df[i].dtype!=object:
        pc,pv=sc.stats.pearsonr(df[i],df["Loan_Status"])
        li.extend([[i,pc,pv]])
li

[['Gender', 0.017986678707032168, 0.656449758464281],
 ['Married', 0.09147782473606049, 0.023398362796619849],
 ['Dependents', 0.0024740538505432976, 0.95121600975350018],
 ['Education', 0.0858839146753652, 0.033360677537289059],
 ['Self_Employed', -0.0037004377149821395, 0.9270899835542965],
 ['ApplicantIncome', -0.0047095226593515289, 0.90728781213037801],
 ['CoapplicantIncome', -0.059187313487850106, 0.14294828684288291],
 ['LoanAmount', -0.035509221752222056, 0.37974410635010403],
 ['Loan_Amount_Term', -0.022548993503422755, 0.57706675907873617],
 ['Credit_History', 1.0, 0.0],
 ['Property_Area', 0.032111984628800376, 0.42702835092014324],
 ['Loan_Status', 1.0, 0.0]]

In [28]:
from sklearn.linear_model import LogisticRegression
lr=LogisticRegression()
X=df[['Credit_History']]
y=df["Loan_Status"]
lr.fit(X,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [29]:
lr.score(X,y)

1.0

In [30]:
from sklearn.model_selection import cross_val_score
a=cross_val_score(lr,X,y,cv=10,scoring='accuracy')
print(a.mean())

1.0

In [31]:
df1=pd.read_csv('F:cvam\loan.csv')

In [32]:
df1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [33]:
df1['Education'].replace("Graduate",1,inplace=True)

In [34]:
df1["Education"].replace("Not Graduate",0,inplace=True)

In [35]:
df1['Credit_History'].replace(np.nan,1,inplace=True)

In [36]:
df1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,1,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,1,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,1,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,1,No,2340,2546,100.0,360.0,1.0,Urban
4,LP001051,Male,No,0,0,No,3276,0,78.0,360.0,1.0,Urban

In [37]:
X_test=df1[["Credit_History"]]
y

0      1
1      0
2      1
3      1
4      1
5      1
6      1
7      0
8      1
9      0
10     1
11     1
12     1
13     0
14     1
15     1
16     1
17     0
18     0
19     1
20     0
21     1
22     0
23     0
24     0
25     1
26     1
27     1
28     0
29     1
      ..
584    0
585    0
586    1
587    1
588    1
589    0
590    1
591    0
592    1
593    1
594    1
595    1
596    0
597    0
598    1
599    1
600    0
601    1
602    1
603    1
604    1
605    0
606    1
607    1
608    1
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [38]:
k=lr.predict(X_test)

In [39]:
k

array([1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1,
       0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], dtype=int64)

In [40]:
df2=pd.DataFrame()
df2["Loan_ID"]=df1["Loan_ID"]
df2["Loan_Status"]=k

In [41]:
df2.head()

    Loan_ID  Loan_Status
0  LP001015            1
1  LP001022            1
2  LP001031            1
3  LP001035            1
4  LP001051            1

In [42]:
df2.set_index("Loan_ID",inplace=True)

In [43]:
df2["Loan_Status"].value_counts()

1    308
0     59
Name: Loan_Status, dtype: int64

In [44]:
df2["Loan_Status"].replace(1,"Y",inplace=True)
df2["Loan_Status"].replace(0,"N",inplace=True)

In [45]:
df2.head()

         Loan_Status
Loan_ID
LP001015           Y
LP001022           Y
LP001031           Y
LP001035           Y
LP001051           Y

In [47]:
df2.to_csv('F:\cvam\su.csv')